#+title: Emacs Configuration
#+author: Yufan Huang 
#+email: huan1754@purdue.edu 
#+options: toc:nil num:nil

* Auctex/Latex

#+begin_src emacs-lisp
;;(use-package auctex 
;;   :ensure t)
(use-package latex
  :after evil
  :ensure auctex 
  :hook ((laTeX-mode . LaTeX-math-mode)
	 (LaTeX-mode . LaTeX-math-mode)))


(use-package xenops
  :disabled
  :config
  (setq xenops-math-image-scale-factor 2.0))
					;(add-hook 'latex-mode-hook #'xenops-mode)
					;(add-hook 'LaTeX-mode-hook #'xenops-mode)  

(setq LaTeX-math-abbrev-prefix (kbd ";"))

(use-package reftex)
(add-hook 'latex-mode-hook 'turn-on-reftex)
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)  

(setq reftex-label-alist '(AMSTeX))
(setq doc-view-resolution 600)
#+end_src

#+RESULTS:
: 600

